# taps to pour 

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/games'
tap 'homebrew/gui'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/services'
tap 'homebrew/tex'
tap 'homebrew/versions'
tap 'homebrew/x11'

# packages to brew
brew 'automake'
brew 'awscli'
brew 'aws-cfn-tools'
brew 'aws-shell'
brew 'base64'
brew 'bash'
brew 'cmake'
brew 'cunit'
brew 'curl', args: ['with-libssh2', 'with-nghttp2']
brew 'ffmpeg'
brew 'fontconfig'
brew 'fortune'
brew 'freetype'
brew 'fswatch'
brew 'git'
brew 'gnutls'
brew 'imagemagick'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libpng'
brew 'libssh'
brew 'libssh2'
brew 'markdown'
brew 'mr'
brew 'openssl'
brew 'pianobar'
brew 'the_silver_searcher'
brew 'vim'
brew 'tree'
brew 'zsh-syntax-highlighting'

# mac apps to install via caskroom
cask 'atom'
cask 'caffeine'
cask 'flux'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-open-iconic'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'iterm2'
cask 'postman'
cask 'slack'
